<a href="https://colab.research.google.com/github/EnricoMartinelli08/Fecap/blob/main/Pre%20processamento%20de%20dados.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
dic = {"Nome":["Isa","Peter","Rico"],
       "Idade":["19","28","0"],
       "Salário":["19000","5000","100"],
       "Gênero":["F", "M", "M"],
       "Cargo":["Gerente","Supervisor",""]
}

In [ ]:
df = pd.DataFrame(dic)
df

    Nome Idade Salário Gênero       Cargo
0    Isa    19   19000      F     Gerente
1  Peter    28    5000      M  Supervisor
2   Rico     0     100      M

In [ ]:
print(df)

    Nome Idade Salário Gênero       Cargo
0    Isa    19   19000      F     Gerente
1  Peter    28    5000      M  Supervisor
2   Rico     0     100      M

In [ ]:
df.info

<bound method DataFrame.info of     Nome Idade Salário Gênero       Cargo
0    Isa    19   19000      F     Gerente
1  Peter    28    5000      M  Supervisor
2   Rico     0     100      M            >

In [ ]:
df = pd.get_dummies(df, columns=["Gênero"])

In [ ]:
df

    Nome Idade Salário       Cargo  Gênero_F  Gênero_M
0    Isa    19   19000     Gerente         1         0
1  Peter    28    5000  Supervisor         0         1
2   Rico     0     100                     0         1

In [ ]:
df

    Nome Idade Salário  Gênero_F  Gênero_M
0    Isa    19   19000         1         0
1  Peter    28    5000         0         1
2   Rico     0     100         0         1